int/resources/objectRepo/xmlTemplates/ows/OWSReservationAdvanced/req_SetKeyData.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:com="http://webservices.micros.com/og/4.3/Common/" xmlns:core="http://webservices.micros.com/og/4.3/Core/" xmlns:res="http://webservices.micros.com/og/4.3/ResvAdvanced/">
   <soapenv:Header>
      <core:OGHeader authToken="?" channelValidation="true" primaryLangID="E" terminalID="?" timeStamp="?" transactionID="?">
         <core:Origin entityID="?" organizationID="?" systemType="?"/>
         <core:Destination entityID="?" organizationID="?" systemType="?"/>
         <core:Intermediaries>
            <core:EndPoint entityID="?" organizationID="?" systemType="?"/>
         </core:Intermediaries>
         <core:Authentication>
            <core:UserCredentials>
               <core:UserName/>
               <core:UserPassword/>
               <core:Domain/>
               <core:SecurityId/>
            </core:UserCredentials>
            <core:Licence>
               <core:Key/>
            </core:Licence>
         </core:Authentication>
      </core:OGHeader>
   </soapenv:Header>
   <soapenv:Body>
      <res:SetKeyDataRequest KeyEncoder="?" KeyExpirationDate="?" Keys="?">
         <res:HotelReference chainCode="?" hotelCode="?"/>
         <res:KeyTrack Key1Track="?" Key2Track="?" Key3Track="?" Key4Track="?"/>
         <res:KeyOptions>
            <com:Code/>
         </res:KeyOptions>
         <res:ReservationID>
            <com:UniqueID source="?" type="?"/>
         </res:ReservationID>
         <res:Profile source="?" type="?"/>
      </res:SetKeyDataRequest>
   </soapenv:Body>
</soapenv:Envelope>